# -*- coding: utf-8 -*-

import random
import datetime
import string


# 身份证号生成器
class IdCardMaker(object):
    def __init__(self):
        self.addr = [(110000, u'北京市'), (110100, u'市辖区'), (110101, u'东城区'), (110102, u'西城区'), (110103, u'崇文区'),
                     (110104, u'宣武区'), (110105, u'朝阳区'), (110106, u'丰台区'), (110107, u'石景山区'),
                     (110108, u'海淀区'),
                     (110109, u'门头沟区'), (110111, u'房山区'), (110112, u'通州区'), (110113, u'顺义区'), (110114, u'昌平区'),
                     (110115, u'大兴区'), (110116, u'怀柔区'), (110117, u'平谷区'), (110200, u'县'), (110228, u'密云县'),
                     (110229, u'延庆县'), (120000, u'天津市'), (120100, u'市辖区'), (120101, u'和平区'), (120102, u'河东区'),
                     (120103, u'河西区'), (120104, u'南开区'), (120105, u'河北区'), (120106, u'红桥区'), (120107, u'塘沽区'),
                     (120108, u'汉沽区'), (120109, u'大港区'), (120110, u'东丽区'), (120111, u'西青区'), (120112, u'津南区'),
                     (120113, u'北辰区'), (120114, u'武清区'), (120115, u'宝坻区'), (120200, u'市辖县'), (120221, u'宁河县'),
                     (120223, u'静海县'), (120225, u'蓟县'), (130000, u'河北省'), (130100, u'石家庄市'), (130101, u'市辖区'),
                     (130102, u'长安区'), (130103, u'桥东区'), (130104, u'桥西区'), (130105, u'新华区'),
                     (130107, u'井陉矿区'),
                     (130108, u'裕华区'), (130121, u'井陉县'), (130123, u'正定县'), (130124, u'栾城县'), (130125, u'行唐县'),
                     (130126, u'灵寿县'), (130127, u'高邑县'), (130128, u'深泽县'), (130129, u'赞皇县'), (130130, u'无极县'),
                     (130131, u'平山县'), (130132, u'元氏县'), (130133, u'赵县'), (130181, u'辛集市'), (130182, u'藁城市'),
                     (130183, u'晋州市'), (130184, u'新乐市'), (130185, u'鹿泉市'), (130200, u'唐山市'), (130201, u'市辖区'),
                     (130202, u'路南区'), (130203, u'路北区'), (130204, u'古冶区'), (130205, u'开平区'), (130207, u'丰南区'),
                     (130208, u'丰润区'), (130223, u'滦县'), (130224, u'滦南县'), (130225, u'乐亭县'), (130227, u'迁西县'),
                     (130229, u'玉田县'), (130230, u'唐海县'), (130281, u'遵化市'), (130283, u'迁安市'), (130300, u'秦皇岛市'),
                     (130301, u'市辖区'), (130302, u'海港区'), (130303, u'山海关区'), (130304, u'北戴河区'),
                     (130321, u'青龙满族自治县'), (130322, u'昌黎县'), (130323, u'抚宁县'), (130324, u'卢龙县'), (130400, u'邯郸市'),
                     (130401, u'市辖区'), (130402, u'邯山区'), (130403, u'丛台区'), (130404, u'复兴区'),
                     (130406, u'峰峰矿区'),
                     (130421, u'邯郸县'), (130423, u'临漳县'), (130424, u'成安县'), (130425, u'大名县'), (130426, u'涉县'),
                     (130427, u'磁县'), (130428, u'肥乡县'), (130429, u'永年县'), (130430, u'邱县'), (130431, u'鸡泽县'),
                     (130432, u'广平县'), (130433, u'馆陶县'), (130434, u'魏县'), (130435, u'曲周县'), (130481, u'武安市'),
                     (130500, u'邢台市'), (130501, u'市辖区'), (130502, u'桥东区'), (130503, u'桥西区'), (130521, u'邢台县'),
                     (130522, u'临城县'), (130523, u'内邱县'), (130524, u'柏乡县'), (130525, u'隆尧县'), (130526, u'任县'),
                     (130527, u'南和县'), (130528, u'宁晋县'), (130529, u'巨鹿县'), (130530, u'新河县'), (130531, u'广宗县'),
                     (130532, u'平乡县'), (130533, u'威县'), (130534, u'清河县'), (130535, u'临西县'), (130581, u'南宫市'),
                     (130582, u'沙河市'), (130600, u'保定市'), (130601, u'市辖区'), (130602, u'新市区'), (130603, u'北市区'),
                     (130604, u'南市区'), (130621, u'满城县'), (130622, u'清苑县'), (130623, u'涞水县'), (130624, u'阜平县'),
                     (130625, u'徐水县'), (130626, u'定兴县'), (130627, u'唐县'), (130628, u'高阳县'), (130629, u'容城县'),
                     (130630, u'涞源县'), (130631, u'望都县'), (130632, u'安新县'), (130633, u'易县'), (130634, u'曲阳县'),
                     (130635, u'蠡县'), (130636, u'顺平县'), (130637, u'博野县'), (130638, u'雄县'), (650104, u'新市区'),
                     (650105, u'水磨沟区'), (650106, u'头屯河区'), (650107, u'达坂城区'), (650108, u'东山区'), (650121, u'乌鲁木齐县'),
                     (650200, u'克拉玛依市'), (650201, u'市辖区'), (650202, u'独山子区'), (650203, u'克拉玛依区'),
                     (650204, u'白碱滩区'), (650205, u'乌尔禾区'), (652100, u'吐鲁番地区'), (652101, u'吐鲁番市'), (652122, u'鄯善县'),
                     (652123, u'托克逊县'), (652200, u'哈密地区'), (652201, u'哈密市'), (652222, u'巴里坤县'),
                     (652223, u'伊吾县'), (652300, u'昌吉州'), (652301, u'昌吉市'), (652302, u'阜康市'), (652303, u'米泉市'),
                     (652323, u'呼图壁县'), (652324, u'玛纳斯'), (652325, u'奇台县'), (652327, u'吉木萨尔县'),
                     (652328, u'木垒县'),
                     (652700, u'博尔塔拉蒙古自治州'), (652701, u'博乐市'), (652722, u'精河县'), (652723, u'温泉县'),
                     (652800, u'巴音郭楞蒙古自治州'), (652801, u'库尔勒市'), (652822, u'轮台县'), (652823, u'尉犁县'), (652824, u'若羌县'),
                     (652825, u'且末县'), (652826, u'焉耆县'), (652827, u'和静县'), (652828, u'和硕县'), (652829, u'博湖县'),
                     (652900, u'阿克苏地区'), (652901, u'阿克苏市'), (652922, u'温宿县'), (652923, u'库车县'),
                     (652924, u'沙雅县'),
                     (652925, u'新和县'), (652926, u'拜城县'), (652927, u'乌什县'), (652928, u'阿瓦提县'), (652929, u'柯坪县'),
                     (653000, u'克州'), (653001, u'阿图什市'), (653022, u'阿克陶县'), (653023, u'阿合奇县'),
                     (653024, u'乌恰县'),
                     (653100, u'喀什地区'), (653101, u'喀什市'), (653121, u'疏附县'), (653122, u'疏勒县'), (653123, u'英吉沙县'),
                     (653124, u'泽普县'), (653125, u'莎车县'), (653126, u'叶城县'), (653127, u'麦盖提县'),
                     (653128, u'岳普湖县'),
                     (653129, u'伽师县'), (653130, u'巴楚县'), (653131, u'塔什库尔干县'), (653200, u'和田地区'), (653201, u'和田市'),
                     (653221, u'和田县'), (653222, u'墨玉县'), (653223, u'皮山县'), (653224, u'洛浦县'),
                     (653225, u'策勒县'),
                     (653226, u'于田县'), (653227, u'民丰县'), (654000, u'伊犁州'), (654002, u'伊宁市'), (654003, u'奎屯市'),
                     (654021, u'伊宁县'), (654022, u'察布查尔县'), (654023, u'霍城县'), (654024, u'巩留县'),
                     (654025, u'新源县'),
                     (654026, u'昭苏县'), (654027, u'特克斯县'), (654028, u'尼勒克县'), (654200, u'塔城地区'), (654201, u'塔城市'),
                     (654202, u'乌苏市'), (654221, u'额敏县'), (654223, u'沙湾县'), (654224, u'托里县'),
                     (654225, u'裕民县'),
                     (654226, u'和布克赛尔蒙古自治县'), (654300, u'阿勒泰地区'), (654301, u'阿勒泰市'), (654321, u'布尔津县'),
                     (654322, u'富蕴县'), (654323, u'福海县'), (654324, u'哈巴河县'), (654325, u'青河县'), (654326, u'吉木乃县'),
                     (659000, u'省直辖行政单位'), (659001, u'石河子市'), (659002, u'阿拉尔市'), (659003, u'图木舒克市'), (659004, u'五家渠市')]

    def getValidateCheckout(self, id17):
        # 获得校验码算法
        weight = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]  # 十七位数字本体码权重
        validate = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2']  # mod11,对应校验码字符值
        sum = 0
        mode = 0
        for i in range(0, len(id17)):
            sum = sum + int(id17[i]) * weight[i]
            mode = sum % 11
        return validate[mode]

    def getRandomIdNumber(self):
        '''
        产生随机可用身份证号，sex = 1表示男性，sex = 0表示女性
        '''
        sex = random.choice([0, 1])
        # 地址码产生
        addr_info = random.randint(0, len(self.addr))  # 随机选择一个值
        addr_id = self.addr[addr_info][0]
        addr_name = self.addr[addr_info][1]
        id_number = str(addr_id)
        # 出生日期码
        start, end = '1960-01-01', '2000-12-30'  # 生日起止日期
        days = (datetime.datetime.strptime(end, '%Y-%m-%d') - datetime.datetime.strptime(start, '%Y-%m-%d')).days + 1
        birth_days = datetime.datetime.strftime(
            datetime.datetime.strptime(start, '%Y-%m-%d') + datetime.timedelta(random.randint(0, days)), '%Y%m%d')
        id_number += str(birth_days)
        # 顺序码
        for i in range(2):  # 产生前面的随机值
            n = random.randint(0, 9)  # 最后一个值可以包括
            id_number += str(n)
        # 性别数字码
        sex_id = random.randrange(sex, 10, step=2)  # 性别码
        id_number += str(sex_id)
        # 校验码
        check_out = self.getValidateCheckout(id_number)
        id_number += str(check_out)
        return id_number, addr_name, addr_id, birth_days, sex, check_out

    def getInfoFromId(self, id18):
        '''
        从身份证号码中得出个人信息：地址、生日、性别
        '''
        addr_id = id18[0:6]
        for it in self.addr:
            if addr_id == str(it[0]):  # 校验码
                addr_name = it[1]
                break
            else:  # 未被break终止
                addr_name = 'unknown'
        birth_days = datetime.datetime.strftime(datetime.datetime.strptime(id18[6:14], '%Y%m%d'), '%Y-%m-%d')
        sex = 'man' if int(id18[-2]) % 2 else 'woman'  # 0为女性，1为男性
        return addr_name, birth_days, sex


# 姓名生成器
class FullNameMaker(object):
    def __init__(self):
        self.last_names = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦',
                           '尤', '许',
                           '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水',
                           '窦', '章',
                           '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任',
                           '袁', '柳',
                           '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬',
                           '安', '常',
                           '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆',
                           '萧', '尹',
                           '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋',
                           '茅', '庞',
                           '熊', '纪', '舒', '屈', '项', '祝', '董', '梁']

        self.first_names = ['的', '一', '是', '了', '我', '不', '人', '在', '他', '有', '这', '个', '上', '们', '来', '到', '时', '大',
                            '地', '为',
                            '子', '中', '你', '说', '生', '国', '年', '着', '就', '那', '和', '要', '她', '出', '也', '得', '里', '后',
                            '自', '以',
                            '会', '家', '可', '下', '而', '过', '天', '去', '能', '对', '小', '多', '然', '于', '心', '学', '么', '之',
                            '都', '好',
                            '看', '起', '发', '当', '没', '成', '只', '如', '事', '把', '还', '用', '第', '样', '道', '想', '作', '种',
                            '开', '美',
                            '总', '从', '无', '情', '己', '面', '最', '女', '但', '现', '前', '些', '所', '同', '日', '手', '又', '行',
                            '意', '动',
                            '方', '期', '它', '头', '经', '长', '儿', '回', '位', '分', '爱', '老', '因', '很', '给', '名', '法', '间',
                            '斯', '知',
                            '世', '什', '两', '次', '使', '身', '者', '被', '高', '已', '亲', '其', '进', '此', '话', '常', '与', '活',
                            '正', '感',
                            '见', '明', '问', '力', '理', '尔', '点', '文', '几', '定', '本', '公', '特', '做', '外', '孩', '相', '西',
                            '果', '走',
                            '将', '月', '十', '实', '向', '声', '车', '全', '信', '重', '三', '机', '工', '物', '气', '每', '并', '别',
                            '真', '打',
                            '太', '新', '比', '才', '便', '夫', '再', '书', '部', '水', '像', '眼', '等', '体', '却', '加', '电', '主',
                            '界', '门',
                            '利', '海', '受', '听', '表', '德', '少', '克', '代', '员', '许', '稜', '先', '口', '由', '死', '安', '写',
                            '性', '马',
                            '光', '白', '或', '住', '难', '望', '教', '命', '花', '结', '乐', '色', '更', '拉', '东', '神', '记', '处',
                            '让', '母',
                            '父', '应', '直', '字', '场', '平', '报', '友', '关', '放', '至', '张', '认', '接', '告', '入', '笑', '内',
                            '英', '军',
                            '候', '民', '岁', '往', '何', '度', '山', '觉', '路', '带', '万', '男', '边', '风', '解', '叫', '任', '金',
                            '快', '原',
                            '吃', '妈', '变', '通', '师', '立', '象', '数', '四', '失', '满', '战', '远', '格', '士', '音', '轻', '目',
                            '条', '呢',
                            '病', '始', '达', '深', '完', '今', '提', '求', '清', '王', '化', '空', '业', '思', '切', '怎', '非', '找',
                            '片', '罗',
                            '钱', '紶', '吗', '语', '元', '喜', '曾', '离', '飞', '科', '言', '干', '流', '欢', '约', '各', '即', '指',
                            '合', '反',
                            '题', '必', '该', '论', '交', '终', '林', '请', '医', '晚', '制', '球', '决', '窢', '传', '画', '保', '读',
                            '运', '及',
                            '则', '房', '早', '院', '量', '苦', '火', '布', '品', '近', '坐', '产', '答', '星', '精', '视', '五', '连',
                            '司', '巴',
                            '奇', '管', '类', '未', '朋', '且', '婚', '台', '夜', '青', '北', '队', '久', '乎', '越', '观', '落', '尽',
                            '形', '影',
                            '红', '爸', '百', '令', '周', '吧', '识', '步', '希', '亚', '术', '留', '市', '半', '热', '送', '兴', '造',
                            '谈', '容',
                            '极', '随', '演', '收', '首', '根', '讲', '整', '式', '取', '照', '办', '强', '石', '古', '华', '諣', '拿',
                            '计', '您',
                            '装', '似', '足', '双', '妻', '尼', '转', '诉', '米', '称', '丽', '客', '南', '领', '节', '衣', '站', '黑',
                            '刻', '统',
                            '断', '福', '城', '故', '历', '惊', '脸', '选', '包', '紧', '争', '另', '建', '维', '绝', '树', '系', '伤',
                            '示', '愿',
                            '持', '千', '史', '谁', '准', '联', '妇', '纪', '基', '买', '志', '静', '阿', '诗', '独', '复', '痛', '消',
                            '社', '算',
                            '义', '竟', '确', '酒', '需', '单', '治', '卡', '幸', '兰', '念', '举', '仅', '钟', '怕', '共', '毛', '句',
                            '息', '功',
                            '官', '待', '究', '跟', '穿', '室', '易', '游', '程', '号', '居', '考', '突', '皮', '哪', '费', '倒', '价',
                            '图', '具',
                            '刚', '脑', '永', '歌', '响', '商', '礼', '细', '专', '黄', '块', '脚', '味', '灵', '改', '据', '般', '破',
                            '引', '食',
                            '仍', '存', '众', '注', '笔', '甚', '某', '沉', '血', '备', '习', '校', '默', '务', '土', '微', '娘', '须',
                            '试', '怀',
                            '料', '调', '广', '蜖', '苏', '显', '赛', '查', '密', '议', '底', '列', '富', '梦', '错', '座', '参', '八',
                            '除', '跑',
                            '亮', '假', '印', '设', '线', '温', '虽', '掉', '京', '初', '养', '香', '停', '际', '致', '阳', '纸', '李',
                            '纳', '验',
                            '助', '激', '够', '严', '证', '帝', '饭', '忘', '趣', '支', '春', '集', '丈', '木', '研', '班', '普', '导',
                            '顿', '睡',
                            '展', '跳', '获', '艺', '六', '波', '察', '群', '皇', '段', '急', '庭', '创', '区', '奥', '器', '谢', '弟',
                            '店', '否',
                            '害', '草', '排', '背', '止', '组', '州', '朝', '封', '睛', '板', '角', '况', '曲', '馆', '育', '忙', '质',
                            '河', '续',
                            '哥', '呼', '若', '推', '境', '遇', '雨', '标', '姐', '充', '围', '案', '伦', '护', '冷', '警', '贝', '著',
                            '雪', '索',
                            '剧', '啊', '船', '险', '烟', '依', '斗', '值', '帮', '汉', '慢', '佛', '肯', '闻', '唱', '沙', '局', '伯',
                            '族', '低',
                            '玩', '资', '屋', '击', '速', '顾', '泪', '洲', '团', '圣', '旁', '堂', '兵', '七', '露', '园', '牛', '哭',
                            '旅', '街',
                            '劳', '型', '烈', '姑', '陈', '莫', '鱼', '异', '抱', '宝', '权', '鲁', '简', '态', '级', '票', '怪', '寻',
                            '杀', '律',
                            '胜', '份', '汽', '右', '洋', '范', '床', '舞', '秘', '午', '登', '楼', '贵', '吸', '责', '例', '追', '较',
                            '职', '属',
                            '渐', '左', '录', '丝', '牙', '党', '继', '托', '赶', '章', '智', '冲', '叶', '胡', '吉', '卖', '坚', '喝',
                            '肉', '遗',
                            '救', '修', '松', '临', '藏', '担', '戏', '善', '卫', '药', '悲', '敢', '靠', '伊', '村', '戴', '词', '森',
                            '耳', '差',
                            '短', '祖', '云', '规', '窗', '散', '迷', '油', '旧', '适', '乡', '架', '恩', '投', '弹', '铁', '博', '雷',
                            '府', '压',
                            '超', '负', '勒', '杂', '醒', '洗', '采', '毫', '嘴', '毕', '九', '冰', '既', '状', '乱', '景', '席', '珍',
                            '童', '顶',
                            '派', '素', '脱', '农', '疑', '练', '野', '按', '犯', '拍', '征', '坏', '骨', '余', '承', '置', '臓', '彩',
                            '灯', '巨',
                            '琴', '免', '环', '姆', '暗', '换', '技', '翻', '束', '增', '忍', '餐', '洛', '塞', '缺', '忆', '判', '欧',
                            '层', '付',
                            '阵', '玛', '批', '岛', '项', '狗', '休', '懂', '武', '革', '良', '恶', '恋', '委', '拥', '娜', '妙', '探',
                            '呀', '营',
                            '退', '摇', '弄', '桌', '熟', '诺', '宣', '银', '势', '奖', '宫', '忽', '套', '康', '供', '优', '课', '鸟',
                            '喊', '降',
                            '夏', '困', '刘', '罪', '亡', '鞋', '健', '模', '败', '伴', '守', '挥', '鲜', '财', '孤', '枪', '禁', '恐',
                            '伙', '杰',
                            '迹', '妹', '藸', '遍', '盖', '副', '坦', '牌', '江', '顺', '秋', '萨', '菜', '划', '授', '归', '浪', '听',
                            '凡', '预',
                            '奶', '雄', '升', '碃', '编', '典', '袋', '莱', '含', '盛', '济', '蒙', '棋', '端', '腿', '招', '释', '介',
                            '烧', '误',
                            '乾', '坤']

    def randomName(self, size=1, chars=string.ascii_letters + string.digits):
        return ''.join(random.choice(chars) for _ in range(size))

    def firstName(self, size=2, ln=None, fn=None):
        _lst = []
        for i in range(size):
            _item = self.randomName(1, fn)
            if ln:
                while _item in ln:
                    _item = self.randomName(1, fn)
                _lst.append(_item)
            else:
                _lst.append(_item)
        return ''.join(_lst)

    def lastName(self, size=1, names=None):
        return self.randomName(size, names)

    def getRandomFullName(self):
        _last = self.lastName(1, self.last_names)
        return '{0}{1}'.format(_last, self.firstName(random.randint(1, 2), _last, self.first_names))


# 手机号生成器
def createPhoneNumber():
    pre_list = ['130', '131', '132', '133', '134', '135', '136', '137', '138', '139', '147', '150', '151', '152', '153',
                '155', '156', '157', '158', '159', '186', '187', '188']
    phone_number = random.choice(pre_list) + ''.join(random.choice('0123456789') for i in range(8))
    return phone_number


# 银行卡号生成器
def createBankNumber():
    pre_list = ['4367', '6227', '6228', '9559', '6222', '9558', '6216', '4563', '6013', '6221', '6210', '6014', '5218',
                '6282', '3568', '6226', '4218', '6229', '4864', '6029', '6029', '6225', '4512', '6214']
    bank_number = random.choice(pre_list) + ''.join(random.choice('0123456789') for i in range(12))
    return bank_number


if __name__ == '__main__':
    BB = FullNameMaker()
    name = BB.getRandomFullName()
    print(name)
